In [1]:
import sqlite3
import pandas as pd

### CSV Data:

In [2]:
df = pd.read_csv(r"D:\Coding\Data-Prep-EDA\Code\Data\course_offerings.csv")
df.head()

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

### Excel Data:

In [3]:
pd.read_excel(r"D:\Coding\Data-Prep-EDA\Code\Data\Course Offerings.xlsx", sheet_name=0)

     Instructor                    Title
0  Chris Bruehl   Lead Python Instructor
1   John Pauler     Chief Growth Officer
2    Alice Zhao  Data Science Instructor

### DB Data:

In [4]:
pd.read_excel(r"D:\Coding\Data-Prep-EDA\Code\Data\Course Offerings.xlsx", sheet_name=1)

   Course ID                  Course Name    Instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [5]:
conn = sqlite3.connect(r"../Data/maven.db")
pd.read_sql("SELECT * FROM courses",conn)

   course_id                       course    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

### Quick Data Overview:

In [6]:
df.shape

(5, 3)

In [7]:
df.head()

   course_id                  course_name    instructor
0        101              Intro to Python  Chris Bruehl
1        102                 Intro to SQL   John Pauler
2        201    Exploratory Data Analysis    Alice Zhao
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [8]:
df.tail(2)

   course_id                  course_name    instructor
3        301                   Algorithms  Chris Bruehl
4        331  Natural Language Processing    Alice Zhao

In [9]:
df.count()

course_id      5
course_name    5
instructor     5
dtype: int64

In [10]:
df.describe()

        course_id
count    5.000000
mean   207.200000
std    107.829495
min    101.000000
25%    102.000000
50%    201.000000
75%    301.000000
max    331.000000

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   course_id    5 non-null      int64
 1   course_name  5 non-null      object
 2   instructor   5 non-null      object
dtypes: int64(1), object(2)
memory usage: 252.0+ bytes

In [12]:
df.dtypes

course_id       int64
course_name    object
instructor     object
dtype: object